Revit 2024 API
DuctSizeSettingIterator Class
 An iterator to a set of items from DuctSizeSettings. Each item is a KeyValuePair(DuctShape::Enum, DuctSizes).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class DuctSizeSettingIterator : IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
Visual Basic
Public Class DuctSizeSettingIterator _
	Implements IEnumerator(Of KeyValuePair(Of DuctShape, DuctSizes))
Visual C++
public ref class DuctSizeSettingIterator : IEnumerator<KeyValuePair<DuctShape, DuctSizes^>>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator
See Also
DuctSizeSettingIterator Members
Autodesk.Revit.DB.Mechanical Namespace